{
  "Nickname": "No More Easy Enemies",
  "Visibility": "Visible",
  "OneLineDescription": "Fixes low-level enemies spawning in high-level dungeons.",
  "LongDescription": "# NoMoreEasyEnemies\nRework NPC leveled list difficulty multipliers and settings to banish low-level enemies from your high-level dungeons.\n\nELI5: No more level 1 draugers in your level 30 dungeon.\n\n## Wait, what?\nThe way Skyrim chooses which NPC to place in a dungeon is...complicated. Long story short, it uses a combination of your level, actor multipliers, the spawn's difficulty setting, and some flags to determine which level of an NPC is standing in a particular spot. \n\nThe problem is that one of the spawn difficulties, \"Easy\", chooses from the list in such a way that it has the (quite good) chance to spawn the lowest-level enemies. There is a flag to turn this off, which \"Easy\" ignores completely. So any time you have an \"Easy\" spawn in a dungeon, there's a chance for you to see a low-level enemy in that spot.\n\nThis patcher reworks the multipliers and the spawn settings to avoid this issue with the \"Easy\" setting.  It optionally updates all Leveled NPC lists to prevent low-level enemies from being spawned.\n\n## How?\nThe easiest way to explain the HOW is with an example.\n\nBy default, Skyrim uses the following spawn difficulty (leveled actors) multipliers:\n- fLeveledActorMultEasy: 0.33\n- fLeveledActorMultMedium: 0.67\n- fLeveledActorMultHard: 1.00\n- fLeveledActorMultVeryHard: 1.25\n\nCritically, if a spawn does NOT have a difficulty set, the multiplier used is a static 1.00.  We can abuse this fact to avoid the issue with the \"Easy\" spawn difficulty.\n\nIf you leave the \"Level Modifier to Replace\" setting at the default of Hard, NoMoreEasyEnemies will do the following:\n- Change fLeveledActorMultMedium to 0.33 (new Easy)\n- Change fLeveledActorMultHard to 0.67 (new Medium)\n- For all enemy spawns (Placed NPCs), if the old difficulty setting was \"Easy\", change it to \"Medium\"\n- For all enemy spawns (Placed NPCs), if the old difficulty setting was \"Medium\", change it to \"Hard\"\n- For all enemy spawns (Placed NPCs), if the old difficulty setting was \"Hard\", delete the setting (force to multiplier of 1.00)\n- Optionally update all Leveled NPC lists to remove the \"Calculate From All Levels Less Than Or Equal Player\" flag if it is set, preventing low level NPCs from spawning when those lists are used\n\nNow there should be NO spawns with a difficulty of \"Easy\". Previously \"Easy\" spawns are now \"Medium\". Previously \"Medium\" spawns are now \"Hard\". Previously \"Hard\" spawns are now empty, so a multiplier of 1.00. And all the Leveled NPC lists will only select the highest-eligible NPCs.\n\n## Settings\nAll settings can be configured inside the Synthesis app.\n\n### Spawn Difficulty to Replace\nThis is the Difficulty (Level Modifier) that will be replaced by a static multiplier of 1.0 (modifier removed).\n\nPick the Modifier with a multiplier closest to 1.0.  \n\nIf your multipliers are vanilla, use 'Hard'.\nIf your multipliers are harder than normal (OWL, SRLEZ, etc), 'Medium' is probably your best bet.\n\nTo get the exact correct value, open up xEdit with your load order. Enter each of the following FormIDs in the 'FormID' box in the top left and hit ENTER. Note the Data/Float value for each setting.  Use the value in the farthest-right column of the right pane. Do NOT use the value in Synthesis.esp, though.\n\n- Easy: 0001A1D9\n- Medium: 0001A1DB\n- Hard: 0001A1DA\n- VeryHard: 00023C0B\n\nWhichever game setting is closest to 1.00 is the difficulty you should set in Synthesis.\n\n**Default**: Hard\n\n### Leveled NPC lists prefer player-level NPCs\nIf enabled, all Leveled NPC lists will be updated to remove the \"Calculate From All Levels Less Than Or Equal Player\" flag if it is set. This will prevent the Leveled NPC list from selecting lower-level NPCs when spawning NPCs. This is slightly more risky if a mod or event depends on lower-level NPCs being selected. Please report any issues with this.\n\n**Default**: enabled\n\n\n## FAQ\n##### Will this break things?\nI don't think so. You're using the same leveled lists that you were before, all we're doing is influencing which NPC will get selected. If you want to be extra safe, disable the \"Leveled NPC lists prefer player-level NPCs\" setting.\n\nAs a precaution, you could create a save before entering a new interior area with enemies. Once you enter a dungeon, the enemies are generated and saved into your next save file, and it is not simple to regenerate them.\n\n##### Why are there still a few level 1 enemies?!?\nBethesda, in its infinite wisdom, has statically set some spawns to use specific NPCs rather than leveled lists. These NPCs are often set to level 1 and do not scale with the player. Call Todd and ask him.",
  "PreferredAutoVersioning": "Default",
  "RequiredMods": []
}